app/views/orders/index.html.erb

SELECT "orders".* FROM "orders"
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
      <tr>
        <td><%= order.order_items.size %></td>