app/controllers/loja_controller.rb

  def create
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]

  def new
    @order = Order.new
    session[:carrinho].each do |item|
      @order.order_items.build(item)
    end
    @order.save!
---
INSERT INTO "order_items" ("product_id", "qtd", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["qtd", 1], ["order_id", 1], ["created_at", "2016-01-21 01:34:58.796600"], ["updated_at", "2016-01-21 01:34:58.796600"]]
INSERT INTO "orders" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-01-21 01:34:58.792121"], ["updated_at", "2016-01-21 01:34:58.792121"]]