app/controllers/orders_controller.rb

INSERT INTO "orders" ("data_compra", "created_at", "updated_at") VALUES (?, ?, ?)  [["data_compra", "2016-01-21"], ["created_at", "2016-01-21 01:37:38.198614"], ["updated_at", "2016-01-21 01:37:38.198614"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save