app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "qtd", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Hiphone"], ["price", 300.0], ["qtd", 10], ["created_at", "2016-01-21 00:29:41.421331"], ["updated_at", "2016-01-21 00:29:41.421331"]]